{
  "content": "\n\nMain Document Content:\nDescription:\nAs a Supplier | Digital Content Controller I want to deliver journal content to Silverchair via APS 24 So that my Silverchair journals workflow benefits from the latest APS design/infrastructure\nContext\nCurrently the business  deliver  journal content to Silverchair via APS 1.9. This ticket is to add a workflow for SC journals to the APS 24 unified workflow.\nForm Requirements\nA Workflow dropdown option titled “Silverchair - Journals” is available in the “OUP - Atlas Deliver” screen. The pre-defined pipeline for all journals content would be JATS2SCJATS.\nIf this workflow is selected, the following form fill options are available for the user to input:\nSubmission type*\nDropdown list\nPreview\nPublish\nSilverchair endpoint*\nDropdown list\nSilverchair Staging\nSilverchair Live (this option should only be available on Prod)\nInclude content from all folders EXCEPT\nDropdown list\nNote this exclusion list would override any file inclusions below\n{issue}\n{package}\nassets\nsupplementary files\npeer review pdf\nThis dropdown also includes a search box and option to Select All / Deselect All\nIf this is left blank, then ALL content is included as default.\nInclude all file types EXCEPT (this list should be generic across all forms - books/collections/journals, and should be alphabetically ordered)\nDropdown list\ndoc/docx\njpg/jpeg\nmrc /marc\ntif /tiff\nxls /xlsx\nThis dropdown also includes a search box and option to Select All / Deselect All\nIf this is left blank, then ALL content is included as default.\n“Submit” button\nFurther notes\nFolder exclusion logic trumps file exclusion (if you’ve excluded a folder, but opted to keep a filetype that is contained within that folder, any content of that filetype in an excluded folder will not be sent)\nDelivery Requirements\nOnce workflow has been submitted it should appear as a row on the workflow records screen\nFailed content should include a failure message\nSuccessful content should deliver to Zipline in expected state (see AC)\nAcceptance Criteria\nGiven that I have navigated to any journal  Issue or Article package  in Atlas, and launched the “OUP - Atlas Deliver” screen (by clicking “Deliver”) When I view the Workflow dropdown options Then I see an option for “Silverchair - Journals”\nGiven that I have selected the “Silverchair - Journals” workflow option When I view my form fill options Then they match the options outlined in the scope above\nGiven I have left one or more mandatory field blank When I select submit Then I see an error message pop up in the UI telling me which fields I need to populate\nGiven I have successfully completed all mandatory fields When I select submit Then my workflow is triggered And then when I go to the Atlas Workflows → Records List APS 24 screen, I see a row for each package included in my delivery with an initial status of “IN PROGRESS”\nGiven that my delivery has failed  When I go to the Atlas Workflows → Records List APS 24 screen Then I see the status “FAILED” against my package, with a failure reason\nGiven that my delivery has succeeded When I go to the Atlas Workflows → Records List APS 24 screen Then I see the status “SUCCESS” against my package\nGiven that my delivery was successful When I go to zipline Then I see my content delivered to expected endpoint, in expected state\nAdditional checks:\nwhere Submission type is “preview” (and content has not previously been published) then content appears in zipline in an UNPUBLISHED state\nwhere Submission type is “preview” (and content HAS previously been published) then content appears in zipline in an UNPUBLISHED state\nwhere Submission type is “ publish ” content is loaded to zipline in a PUBLISHED state\nwhere Silverchair endpoint is “Silverchair Staging” content is loaded to the staging site\nwhere Silverchair endpoint is “Silverchair Live” content is loaded to the live site (note that this can only be tested on prod, users cannot deliver to live from lower  envs ).\nverify folder exclusion logic works as expected\nverify file exclusion logic works as expected\n\n\n### Universal Business Element Analysis:\n- **Total Business Elements**: 59\n- **Quality Score**: 50%\n- **High Confidence Elements**: 14\n- **Testable Elements**: 5\n\n### Element Breakdown:\n- **Business Processes**: 1\n- **System Requirements**: 7\n- **Decision Points**: 0\n- **Process Steps**: 9\n- **Business Rules**: 30\n- **User Actions**: 8\n- **Validation Requirements**: 4\n\n### Universal Analysis:\nThis universal business requirements extractor identified **59 business requirements** using consistent patterns across all file types. Quality Score: 50%",
  "fileName": "acceptanceCriteria.docx",
  "fileSize": 19283,
  "processedAt": "2025-10-07T15:02:19.946Z",
  "_cacheInfo": {
    "hit": false,
    "cachedAt": "2025-10-07T15:02:19.946Z",
    "originalFilename": "acceptanceCriteria.docx",
    "hash": "156911add123450f89a84a3acae94fc09bb16953ce871fcc88a179919e7d8361"
  }
}